cmsis-svd/cmsis-svd/data/Microchip/ATSAMC21N.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>COMPCTRL%s</name>
          <description>Comparator Control n</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SINGLE</name>
              <description>Single-Shot Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTSEL</name>
              <description>Interrupt Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>INTSELSelect</name>
                <enumeratedValue>
                  <name>TOGGLE</name>
                  <description>Interrupt on comparator output toggle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Interrupt on comparator output rising</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Interrupt on comparator output falling</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EOC</name>
                  <description>Interrupt on end of comparison (single-shot mode only)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>Negative Input Mux Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>MUXNEGSelect</name>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>I/O pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>I/O pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>I/O pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>I/O pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSCALE</name>
                  <description>VDD scaler</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDGAP</name>
                  <description>Internal bandgap voltage</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC output</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXPOS</name>
              <description>Positive Input Mux Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>MUXPOSSelect</name>
                <enumeratedValue>
                  <name>PIN0</name>
                  <description>I/O pin 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN1</name>
                  <description>I/O pin 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN2</name>
                  <description>I/O pin 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIN3</name>
                  <description>I/O pin 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSCALE</name>
                  <description>VDD Scaler</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap Inputs and Invert</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPEED</name>
              <description>Speed Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SPEEDSelect</name>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low speed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High speed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYSTEN</name>
              <description>Hysteresis Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEN</name>
              <description>Filter Length</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>FLENSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>No filtering</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAJ3</name>
                  <description>3-bit majority function (2 of 3)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAJ5</name>
                  <description>5-bit majority function (3 of 5)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>Output</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OUTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>The output of COMPn is not routed to the COMPn I/O port</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>The asynchronous output of COMPn is routed to the COMPn I/O port</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Synchronization Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable Synchronization Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINCTRL</name>
              <description>WINCTRL Synchronization Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPCTRL0</name>
              <description>COMPCTRL 0 Synchronization Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPCTRL1</name>
              <description>COMPCTRL 1 Synchronization Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPCTRL2</name>
              <description>COMPCTRL 2 Synchronization Busy</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPCTRL3</name>
              <description>COMPCTRL 3 Synchronization Busy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
