cmsis-svd/cmsis-svd/data/Microchip/ATSAMC21N.svd
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x06</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EVACT</name>
              <description>Event Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACTSelect</name>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Event action disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RETRIGGER</name>
                  <description>Start, restart or retrigger TC on event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNT</name>
                  <description>Count on event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Start TC on event</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAMP</name>
                  <description>Time stamp capture</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PPW</name>
                  <description>Period catured in CC0, pulse width in CC1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWP</name>
                  <description>Period catured in CC1, pulse width in CC0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PW</name>
                  <description>Pulse width capture</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCINV</name>
              <description>TC Event Input Polarity</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCEI</name>
              <description>TC Event Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVFEO</name>
              <description>Event Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO0</name>
              <description>MC Event Output Enable 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCEO1</name>
              <description>MC Event Output Enable 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>OVF Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>MC Interrupt Disable 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>MC Interrupt Disable 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>OVF Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>MC Interrupt Enable 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>MC Interrupt Enable 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>OVF</name>
              <description>OVF Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERR</name>
              <description>ERR Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC0</name>
              <description>MC Interrupt Flag 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MC1</name>
              <description>MC Interrupt Flag 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>STOP</name>
              <description>Stop Status Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLAVE</name>
              <description>Slave Status Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERBUFV</name>
              <description>Synchronization Busy Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBUFV0</name>
              <description>Compare channel buffer 0 valid</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCBUFV1</name>
              <description>Compare channel buffer 1 valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WAVE</name>
          <description>Waveform Generation Control</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WAVEGEN</name>
              <description>Waveform Generation Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WAVEGENSelect</name>
                <enumeratedValue>
                  <name>NFRQ</name>
                  <description>Normal frequency</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MFRQ</name>
                  <description>Match frequency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPWM</name>
                  <description>Normal PWM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MPWM</name>
                  <description>Match PWM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DRVCTRL</name>
          <description>Control C</description>
          <addressOffset>0x0D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>INVEN0</name>
              <description>Output Waveform Invert Enable 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVEN1</name>
              <description>Output Waveform Invert Enable 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x0F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Run During Debug</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Status</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>swrst</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRLB</name>
              <description>CTRLB</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATUS</name>
              <description>STATUS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COUNT</name>
              <description>Counter</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC0</name>
              <description>Compare Channel 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CC1</name>
              <description>Compare Channel 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT</name>
          <description>COUNT32 Count</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Counter Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s</name>
          <description>COUNT32 Compare and Capture</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CC</name>
              <description>Counter/Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s</name>
          <description>COUNT32 Compare and Capture Buffer</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCBUF</name>
              <description>Counter/Compare Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
